print("바밤바는")
print("밤이들어간")
print("바이다.")

#숫자 50과 숫자 50을 더해서 출력해봅시다!
print(50+50)

#문자열 "50"과 문자열 "50"을 더해서 출력해봅시다!
print('50'+'50')

#리스트 [50]과 리스트 [50]을 더해서 출력해봅시다!
print([50]+[50])

# 변수에는 정수, 실수같은 숫자를 저장할 수 있고,
num1 = 1
num2 = 2 
# 영어나 한글같은 문자도 저장할 수 있어요.
character = 'a'

# 이런 문자들의 집합도 저장할 수 있고,
string = 'Python'

# 자료들을 여러 개 담을 수 있는 리스트 또한 저장할 수 있어요.
threeList = [1, 'a', 'Python']

# 여러분의 변수를 만들어 봅시다. my_var라는 이름의 변수를 만들고, 원하는 값을 넣어보세요!
my_var = '진석'

# 변수는 print()에 넣을 수도 있어요! my_var를 print로 출력해서 값이 잘 들어갔는지 확인해봅시다!
print(my_var)

# 변수끼리는 연산 또한 가능합니다. 예를들어, 위에 있는 num1, num2을 더하면?!
print(num1+num2)

# 변수에 문자열로 된 정수와 실수를 저장하면, 
a = '345'
b = '1.567'

# 출력 시 숫자로 보이지만 문자열이에요!
print(a, b)
print(type(a))
print(type(b))

# a, b 변수의 값을 알맞은 함수를 활용하여 숫자형으로 변경하고 변수 c, d에 저장하세요.
c = int(a) # 정수
d = float(c) # 실수

# print()를 통해 c, d의 값과 자료형을 확인해봅시다!
print(c, d)
print(type(c))
print(type(d))
