package edu.kmit.abstractclass;

public class AbstractExam {
	/*
	 * 추상 클래스(abstract class)
	 *  - 추상 메소드가 1개 이상인 클래스!
	 *  - 추상 메소드는 바디({})가 없는 메소드를 말한다.
	 *   	추상 메소드 --> void make();
	 *  - 연관이 있는 클래스들 끼리의 상속관계를 나타낸다.ㅏ
	 *  - 추상 메소드 앞에는 abstract 키워드를 붙여 준다.
	 *  - 추상 클래스의 앞에도 abstract 키워드를 붙여 준다.
	 *  - 상속을 강요한다!(상속받는 클래스는 반드시 추상 메소드를 구현해야 한다!)!
	 *  - 상속할때 키워드는 extends를 사용한다!
	 *  - 추상 클래스에서 선언된 추상 메소드는 상속된 클래스에서 반드시 구현되어야 하며,
	 *    그렇지 않을 경우에는 오류가 발생한다!
	 *  - 추상 클래스는 추상클래스의 이름으로 추상 클래스를 생성할 수 없다.
	 *  - 용도 : 공통적인 것들을 구현하고, 상속 받은 곳에서 다시 구현해야 하는 기능들은 추상 메소드로 선언만 해놓는다.
	 * */
	public static void main(String[] args) {
		// 추상 클래스 테스트, 다형성 발생원리 첫번째!
		Elephant ele = new AsiaElephant();
		ele.eat();
		
		// 추상 클래스의 이름으로 추상 클래스를 생성
//		Elephant ele2 = new Elephant;
		// 추상 클래스를 사용하려면 부모의 이름으로 자식을 생성해서 사용
	}
}
